app/controllers/visit/profile_controller.rb

        def show
            id = params[:id]
            @user = User.find(id)
            @users = session[:user_id]
            @review = Review.where(:user_id => @user)
            @library = Store.where(:user_id => @user,:selling => 'true')
            @friends = Friend.where(:user_id => @user.id,:favorite => 'true')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1 AND "stores"."selling" = $2  [["user_id", 1], ["selling", "true"]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1 AND "friends"."favorite" = $2  [["user_id", 1], ["favorite", "true"]]