app/views/visit/profile/show.haml

            %a.sidebar__nav__link{:href => myProfile_path, "data-method" => "get"}
              =image_tag (User.find(@users).avatar), class: "img3"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

            .grid-item-details_alt
              -if (Friend.exists?(:user_id => @users, :friend_id => @user.id))
                - if (Friend.where(:user_id => @users, :friend_id => @user.id)[0].favorite == "true")
---
SELECT  1 AS one FROM "friends" WHERE "friends"."user_id" = $1 AND "friends"."friend_id" = $2 LIMIT $3  [["user_id", 3], ["friend_id", 1], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1 AND "friends"."friend_id" = $2  [["user_id", 3], ["friend_id", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1 AND "friends"."favorite" = $2  [["user_id", 1], ["favorite", "true"]]

              %h5.sub-header-details Selling games:
              %span #{Store.where(:user_id => @user.id, :selling => 'true').length}
---
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1 AND "stores"."selling" = $2  [["user_id", 1], ["selling", "true"]]

                - @library.each do |game|
                  - @games = Game.find(game.game_id)
                  .card
                    .content.cardPadding
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]