VGdatabase/app/controllers/games_controller.rb

    def homepage
        @user = User.find(session[:user_id])
        @games = Game.all
        @library = Store.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "games".* FROM "games"
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = ? AND "stores"."game_id" = ?  [["user_id", 1], ["game_id", 1]]

    def myStore
        @library = Store.all
        @user = User.find(session[:user_id])
---
SELECT "stores".* FROM "stores"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def myStoreEdit
        @mylibrary = Store.all
        @user = User.find(session[:user_id])
---
SELECT "stores".* FROM "stores"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def selling
        @user = User.find(session[:user_id])
        @library = Store.where(:user_id => @user.id, :selling => 'true')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = ? AND "stores"."selling" = ? AND "stores"."user_id" = ?  [["user_id", 1], ["selling", "true"], ["user_id", 1]]

    def friends
        @user = User.find(session[:user_id])
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."user_id" = ?  [["user_id", 1], ["user_id", 1]]

    def myProfile
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 5
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 5]]

    def editProfile
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 5
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 5]]

    def editAvatar
        @avatar = Avatar.all
---
SELECT "avatars".* FROM "avatars"

    def editingAvatar
        @user = User.find(session[:user_id])
        avatar = params[:avatar]
        @user.update_attributes!(:avatar => avatar)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar", "Avatar/avatar_1"], ["updated_at", "2020-04-25 13:39:11.371155"], ["id", 5]]

    def editingProfile
        username = params[:user][:name]
        email = params[:user][:email]
        oldp = params[:user][:oldp]
        newp = params[:user][:newp]
        newp1 = params[:user][:newp1]
        @user = User.find(session[:user_id])
        if username.length==0 && email.length==0 && oldp.length==0 && newp.length==0 && newp1.length==0
            redirect_to myProfile_path
        elsif username.length==0 && email.length==0 && newp.length!=0 && newp==newp1 && oldp==@user.password
            @user.update_attributes!(:password => newp)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "ciao"], ["username", "marc"], ["updated_at", "2020-04-22 13:04:00.386118"], ["id", 5]]

    def editProfile_success
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 5
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 5]]

    def editProfile_error
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 5
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 5]]

    def show
        id = params[:id]
        @games = Game.find(id)
        @library = Store.where(:user_id => session[:user_id])
        @user = session[:user_id]
        @aux = Review.where(:game_id => @games)
        @aux = @aux.where('user_id != ?', @user)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = 1 AND (user_id != 5)
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = 1 AND "reviews"."user_id" = ?  [["user_id", 5]]

    def contactUs
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def deleteUser
        name = session[:user_id]
        @friends = Friend.where(:user_id => name)
        @friends.each do |friend|
            friend.delete
        end
        @friends1 = Friend.where(:friend_id => name)
        @friends1.each do |friend|
            friend.delete
        end
        @review = Review.where(:user_id => name)
        @review.each do |review|
            review.delete
        end
        @library = Store.where(:user_id => name)
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 22]]
SELECT "friends".* FROM "friends" WHERE "friends"."friend_id" = ?  [["friend_id", 22]]
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 11]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 22]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 12]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = ?  [["user_id", 2]]

    def searchUser
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def searchingUser
        user = params[:username]
        if User.exists?(User.where(:username => user))
---
SELECT  1 AS one FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."username" = ?) LIMIT ?  [["username", "6"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "marco"]]

    def searchGame
        @games = Game.all
        @user = User.find(session[:user_id])
---
SELECT "games".* FROM "games"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def searchingGame
        search = params[:search]
        genre = params[:game][:genre]
        platform = params[:game][:platform]
        choice = params[:game][:choice]
        if choice == 'Title'
            if Game.exists?(Game.where(:title => search, :platform => platform, :genre => genre))
---
SELECT  1 AS one FROM "games" WHERE "games"."id" IN (SELECT "games"."id" FROM "games" WHERE "games"."title" = ? AND "games"."platform" = ? AND "games"."genre" = ?) LIMIT ?  [["title", "Title"], ["platform", "PC"], ["genre", "sandbox"], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."title" = ? AND "games"."platform" = ? AND "games"."genre" = ?  [["title", "Minecraft"], ["platform", "PC"], ["genre", "sandbox"]]

    def deletingReviewsGame
        game1 = params[:game][:title]
        if(Game.exists?(:title => game1))
            @game = Game.where(:title => game1)[0].id
            if(Review.exists?(:game_id => @game))
                @review = Review.where(:game_id => @game)
                @review.each do |review|
                    Review.delete(review.id)
---
SELECT  1 AS one FROM "games" WHERE "games"."title" = ? LIMIT ?  [["title", "Minecraft"], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."title" = ?  [["title", "Minecraft"]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."game_id" = ? LIMIT ?  [["game_id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]

    def deletingReviewsUser
        user1 = params[:user][:name]
        game1 = params[:game][:title]
        if(User.exists?(:username => user1) && Game.exists?(:title => game1))
            @user = User.where(:username => user1)[0].id
            @game = Game.where(:title => game1)[0].id
            if(Review.exists?(:user_id => @user,:game_id => @game))
                @review = Review.where(:user_id => @user,:game_id => @game)[0].id
                Review.delete(@review)
---
SELECT  1 AS one FROM "games" WHERE "games"."title" = ? LIMIT ?  [["title", "Minecraft"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "marco"], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."title" = ?  [["title", "Minecraft"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "marco"]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."game_id" = ? LIMIT ?  [["user_id", 5], ["game_id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."game_id" = ?  [["user_id", 5], ["game_id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 9]]