VGdatabase/app/controllers/sessions_controller.rb

def signin
        name = params[:user][:name]
        password = params[:user][:password]
        name1 = params[:user][:name1]
        password1 = params[:user][:password1]
        if User.exists?(:email => name)         # Vede se esiste già la mail
            redirect_to signup_error_mail_path
        elsif name1 == 'admin'                  # Non può creare un nuovo admin
            redirect_to signup_error_username_path
        elsif User.exists?(:username => name1)  # Username già esistente
            redirect_to signup_error_username_path
        elsif password != password1             # Password non coincidono
            redirect_to signup_error_password_path
        else                                    # Controlli a buon fine
            @users = User.create(:email => name, :password => password, :username => name1, :avatar => 'Avatars/avatar_0',:background => 'default.png')
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ciao@co"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "marco"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "username", "password", "avatar") VALUES (?, ?, ?, ?)  [["email", "ciao@co"], ["username", "marco"], ["password", "ciao"], ["avatar", "Avatars/avatar_0"]]

def create
    name = params[:user][:name]
    username = params[:user][:name1]
    password = params[:user][:password]
    if User.exists?(User.where(:username => name))
---
SELECT  1 AS one FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."username" = ?) LIMIT ?  [["username", "marco"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "marco"]]

def homepageGuest
    @games = Game.all
---
SELECT "games".* FROM "games"

def searchingGuestUser
    user = params[:username]
    if User.exists?(User.where(:username => user))
---
SELECT  1 AS one FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."username" = ?) LIMIT ?  [["username", "6"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "Nidran"]]

def searchGuestGame
    @games = Game.all
---
SELECT "games".* FROM "games"

def searchingGuestGame
    search = params[:search]
    genre = params[:game][:genre]
    platform = params[:game][:platform]
    choice = params[:game][:choice]
    if choice == 'Title'
        if Game.exists?(Game.where(:title => search, :platform => platform, :genre => genre))
---
SELECT  1 AS one FROM "games" WHERE "games"."id" IN (SELECT "games"."id" FROM "games" WHERE "games"."title" = ? AND "games"."platform" = ? AND "games"."genre" = ?) LIMIT ?  [["title", "Minecraft"], ["platform", "PC"], ["genre", "sandbox"], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."title" = ? AND "games"."platform" = ? AND "games"."genre" = ?  [["title", "Minecraft"], ["platform", "PC"], ["genre", "sandbox"]]