VGdatabase/app/controllers/stores_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "stores" ("game_id", "user_id", "selling", "price") VALUES (?, ?, ?, ?)  [["game_id", 1], ["user_id", 1], ["selling", "false"], ["price", 0]]
---
    def create
        game_id = params[:game_id]
        @games = Game.find(game_id)
        user_id = session[:user_id]
        @user = User.find(session[:user_id])
        @mylibrary = Store.new(:selling => 'false', :price => 0)
        @mylibrary.user_id = @user.id
        @mylibrary.game_id = @games.id
        @mylibrary.save!

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 1]]
---
    def destroy
        id = params[:id]
		@mygame = Store.find(id)
        @mygame.destroy

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stores" SET "selling" = ? WHERE "stores"."id" = ?  [["selling", "true"], ["id", 1]]
---
    def update
        id = params[:id]
        @mygame = Store.find(id)
        if @mygame.selling == "false"
            @mygame.update_attributes!(:selling => "true")