app/views/games/editProfile.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]
---
                  .grid-item-detailsImg
                    =image_tag (User.find(friend.friend_id).avatar) ,class: "reviewImg"

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
              - @review.each do |review|
                - @game = Game.find(review.game_id)
                .reviewUser