app/views/games/editProfile_success.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]
---
                  .grid-item-detailsImg
                    =image_tag (User.find(friend.friend_id).avatar) ,class: "reviewImg"