app/views/games/friends.haml

                  %span View profile
                =image_tag (User.find(friend.friend_id).avatar) ,class: "reviewImg"
              .grid-item-detailsProfile
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

                  %span.sub-header-details Games in the collection:
                  %span #{Store.where(:user_id => friend.friend_id).length}
---
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1  [["user_id", 2]]