app/views/games/myProfile.haml

              %h5.sub-header-details Selling games:
              %span #{Store.where(:user_id => @user.id, :selling => 'true').length}
---
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1 AND "stores"."selling" = $2  [["user_id", 1], ["selling", "true"]]

                  .grid-item-detailsImg
                    =image_tag (User.find(friend.friend_id).avatar) ,class: "reviewImg"
                    %a{:href => visit_profile_path(friend.friend_id), "data-method" => "get"} #{User.find(friend.friend_id).username}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "r.giovanni.98@gmail.com"]]

                  %a{:href => room_path(Room.where(:user => room.user,:user1 => room.user1)[0].id), "data-method" => "get"} #{User.where(:username => room.user)[0].username}
                  -if RoomMessage.exists?(:room_id => room.id)
---
SELECT  "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1 ORDER BY "room_messages"."id" DESC LIMIT $2  [["room_id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "room_messages" WHERE "room_messages"."room_id" = $1 LIMIT $2  [["room_id", 8], ["LIMIT", 1]]

              - @review.each do |review|
                - @game = Game.find(review.game_id)
                .reviewUser
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]