app/views/games/searchResult.haml

SELECT  1 AS one FROM "games" WHERE "games"."serial" = $1 LIMIT $2  [["serial", 1626], ["LIMIT", 1]]
---
                %p.description Platforms: #{@platform}
                -if Game.exists?(:serial => game.values[0])