app/views/games/selling.haml

        - if (game.user_id == @user.id)
          - @games = Game.find(game.game_id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]