app/views/games/settings.haml

        - @libraries.each do |library|
          - user = User.find(library.user_id).username
          - game1 = Game.find(library.game_id).title
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]