app/views/games/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <a class="sidebar__nav__link" data-method="get" href="<%= myProfile_path %>">
              <%= image_tag (User.find(@user).avatar), class: "img3" %>