app/views/rooms/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
                    <a class="sidebar__nav__link" data-method="get" href="<%= myProfile_path %>">
                        <%= image_tag (User.find(session[:user_id]).avatar), class: "img3" %>

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "ok"]]
---
        </i>
        <%if (User.find(session[:user_id]).username==@room.user1)%>