VGdatabase/app/controllers/visit/profile_controller.rb

        def show
            id = params[:id]
            @user = User.find(id)
            @users = session[:user_id]
            @review = Review.where(:user_id => @user)
            @library = Store.where(:user_id => @user, :selling => 'true')
            @friends = Friend.where(:user_id => @user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 1
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = 1
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."friend_id" = ?  [["user_id", 5], ["friend_id", 1]]