app/controllers/guest/show_controller.rb

        def show
            id = params[:id]
            @game = Game.find(id)
            @review = Review.where(:game_id => @game)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = $1  [["game_id", 3]]