VGdatabase/app/views/guest/show/show.haml

              - @review.each do |review|
                - @users = User.where(:id => review.user_id)[0]
                .reviewUser
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]