VGdatabase/app/views/games/editProfile_error.haml

                  .grid-item-detailsImg
                    =image_tag (User.find(friend.friend_id).avatar) ,class: "reviewImg"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 5]]

              - @review.each do |review|
                - @game = Game.find(review.game_id)
                .reviewUser
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]