VGdatabase/app/views/games/friends.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."user_id" = ?  [["user_id", 1], ["user_id", 1]]
---
                  %span View profile
                =image_tag (User.find(friend.friend_id).avatar) ,class: "reviewImg"
              .grid-item-detailsProfile

SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = ?  [["user_id", 1]]
---
                  %a2.sub-header-details Games in the collection:
                  %span #{Store.where(:user_id => friend.friend_id).length}