VGdatabase/app/views/games/myProfile.haml

              %h5.sub-header-details Games in your library:
              %span #{Store.where(:user_id => @user.id).length}
            .grid-item-details
---
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = ?  [["user_id", 1]]

                .grid-item-detailsImg
                  =image_tag (User.find(friend.friend_id).avatar) ,class: "reviewImg"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 5]]

              - @review.each do |review|
                - @game = Game.find(review.game_id)
                .reviewUser
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]