VGdatabase/app/views/games/selling.haml

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        - if (game.user_id == @user.id)
          - @games = Game.find(game.game_id)