VGdatabase/app/views/games/show.haml

            %a.sidebar__nav__link{:href => myProfile_path, "data-method" => "get"}
              =image_tag (User.find(@user).avatar), class: "img3"
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? AND "users"."game_id" = 1  [["user_id", 5]]