app/controllers/api_controller.rb

    def apiRest #Gioco con quel titolo
        title = params[:title]
        @games = Game.where(:title => title)
---
SELECT "games".* FROM "games" WHERE "games"."title" = $1  [["title", "Monster Hunter: World - Iceborne"]]

    def apiRest2 #Mostra utente tramite id/email/username
        key = params[:key]
        id = params[:id]
        username = params[:username]
        mail = params[:mail]
        if key=='123456789'
            if id.length!=0 && User.exists?(:id => id)
                @user = User.select(:id,:username,:email,:google_token,:steam_token,:background,:avatar,:social1,:social2,:social3).where(:id => id)[0]
                render json: @user
            elsif username!=nil && User.exists?(:username => username)
                @user = User.select(:id,:username,:email,:google_token,:steam_token,:background,:avatar,:social1,:social2,:social3).where(:username => username)[0]
                render json: @user
            elsif mail!=nil && User.exists?(:email => mail)
---
SELECT "users"."id", "users"."username", "users"."email", "users"."google_token", "users"."steam_token", "users"."background", "users"."avatar", "users"."social1", "users"."social2", "users"."social3" FROM "users" WHERE "users"."username" = $1  [["username", "Marco"]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Marco"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "p@p"], ["LIMIT", 1]]

    def apiRest3 #Mostra le review dell'utente o di un gioco specifico tramite id
        game_id = params[:game_id]
        user_id = params[:user_id]
        key = params[:key]
        if key=='123456789'
            if user_id!=nil && User.exists?(:id => user_id)
                @re1 = Review.where(:user_id => User.find(user_id).id)
                render json: @re1
            elsif game_id!=nil && Game.exists?(:id => game_id)
                @re2 = Review.where(:game_id => User.find(game_id).id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 14]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = $1  [["game_id", 2]]

    def apiRest4 #Amici di un dato utente
        user_id = params[:user_id]
        key = params[:key]
        if key=='123456789'
            if user_id!=nil && User.exists?(:id => user_id)
                @f1 = Friend.where(:user_id => User.find(user_id).id)
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 2]]

    def apiRest5 #Collezione di un dato utente
        user_id = params[:user_id]
        key = params[:key]
        if key=='123456789'
            if user_id!=nil && User.exists?(:id => user_id)
                @m1 = Store.where(:user_id => User.find(user_id).id)
---
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1  [["user_id", 14]]

    def apiRest6 #Creazione di un utente
        username = params[:username]
        password = params[:password]
        email = params[:email]
        key = params[:key]
        if key=='123456789'
            if !User.exists?(:username => username, :email => email)
                User.create(:username => username, :password => password, :email => email, :avatar => 'Avatars/avatar_0',:background => 'deafult.png', :social1 => '', :social2 => '', :social3 => '')
---
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 AND "users"."email" IS NULL LIMIT $2  [["username", "CIAO"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "CIAO"]]
INSERT INTO "users" ("username", "password", "avatar", "background", "social1", "social2", "social3") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["username", "CIAO"], ["password", "salve"], ["avatar", "Avatars/avatar_0"], ["background", "deafult.png"], ["social1", ""], ["social2", ""], ["social3", ""]]

    def apiRest7 #Eliminazione di un dato utente
        username = params[:username]
        key = params[:key]
        if key=='123456789'
            if User.exists?(:username => username)
                User.delete(User.where(:username => username)[0].id)
---
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "CIAO"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "CIAO"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 15]]

    def apiRest8 #Modifica di alcuni attributi del profilo di un utente
        usernameold = params[:usernameold]
        usernamenew = params[:usernamenew]
        password = params[:password]
        email = params[:email]
        key = params[:key]
        if key=='123456789'
            if User.exists?(:username => usernameold)
                User.where(:username => usernameold)[0].update_attributes!(:username => usernamenew, :password => password, :email => email)
---
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Marco"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Marco"]]
UPDATE "users" SET "username" = $1, "password" = $2, "email" = $3 WHERE "users"."id" = $4  [["username", "marco"], ["password", "ciao"], ["email", nil], ["id", 2]]