app/controllers/games_controller.rb

    def homepage
        @user = User.find(session[:user_id])
        game = Game.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "games".* FROM "games" ORDER BY games.title ASC

                    api.fields(:name).where(:id => involved_companies).limit(1).request
                    companies = api.request[0].values[1]

                    Game.create(:serial => games.values[0], :platform => platform, :genre => genres, :cover => split, :title => games.values[4], :release_date => date, :developer => companies)
---
INSERT INTO "games" ("title", "serial", "developer", "platform", "release_date", "cover", "genre") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def collection
        @library = Store.all
        @user = User.find(session[:user_id])
---
SELECT "stores".* FROM "stores"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def selling
        @library = Store.where(:selling => "true")
        @user = User.find(session[:user_id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."selling" = $1  [["selling", "true"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def collectionEdit
        @mylibrary = Store.all
        @user = User.find(session[:user_id])
---
SELECT "stores".* FROM "stores"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def editSelling
        @mylibrary = Store.where(:selling => "true")
        @user = User.find(session[:user_id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."selling" = $1  [["selling", "true"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def friends
        @user = User.find(session[:user_id])
        @friends = Friend.where(:user_id => @user.id, :favorite => 'true')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1 AND "friends"."favorite" = $2 AND "friends"."user_id" = $3  [["user_id", 3], ["favorite", "true"], ["user_id", 3]]

    def myProfile
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id,:favorite => 'true')
        @friends1 = Friend.where(:user_id => @user.id,:favorite => 'false')
        @roomv1 = Room.where(:user1 => @user.username)
        @roomv2 = []
        @roomv1.each do |room|
            if RoomMessage.exists?(:room_id => room.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1 AND "friends"."favorite" = $2  [["user_id", 1], ["favorite", "true"]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user1" = $1 AND "rooms"."user" = $2  [["user1", "r.giovanni.98@gmail.com"], ["user", "Nidran"]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "r.giovanni.98@gmail.com"]]
SELECT  "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1 ORDER BY "room_messages"."id" DESC LIMIT $2  [["room_id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "room_messages" WHERE "room_messages"."room_id" = $1 LIMIT $2  [["room_id", 8], ["LIMIT", 1]]

    def editProfile
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 2]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]

    def editProfileOauth
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]

    def editingProfileOauth
        username = params[:user][:name]
        email = params[:user][:email]
        newp = params[:user][:newp]
        newp1 = params[:user][:newp1]
        location = params[:user][:location]
        @user = User.find(session[:user_id])
        if username.length==0 && email.length==0 && newp.length==0 && newp1.length==0 && location.length==0
            redirect_to editProfileOauth_error_path
        elsif username.length!=0 && email.length!=0 && newp.length!=0 && newp==newp1 && location.length!=0
            if Geocoder.search(location) != []
                lat = Geocoder.search(location).last.latitude
                lng = Geocoder.search(location).last.longitude
                @user.update_attributes!(:username => username, :email => email, :password => newp, :location => location,:latitude => lat, :longitude => lng)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "password" = $2, "location" = $3, "latitude" = $4, "longitude" = $5 WHERE "users"."id" = $6  [["email", "r.giovanni.98@gmail.com"], ["password", "crashbug"], ["location", "Via Stefano Borgia 167"], ["latitude", 41.1294487], ["longitude", 14.7812542], ["id", 1]]

    def editProfileOauth_error
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]

    def editProfileOauth_success
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]

    def editAvatar
        @avatar = Avatar.all
---
SELECT "avatars".* FROM "avatars"

    def editingProfile
        username = params[:user][:name]
        email = params[:user][:email]
        oldp = params[:user][:oldp]
        newp = params[:user][:newp]
        newp1 = params[:user][:newp1]
        location = params[:user][:location]
        social1 = params[:user][:social1]
        social2 = params[:user][:social2]
        social3 = params[:user][:social3]
        @user = User.find(session[:user_id])
        if username.length!=0 && email.length!=0 && newp.length!=0 && newp==newp1 && oldp==@user.password && location.length!=0
            if Geocoder.search(location) != []
                lat = Geocoder.search(location).last.latitude
                lng = Geocoder.search(location).last.longitude
                @user.update_attributes!(:latitude => lat, :longitude => lng, :password => newp, :username => username, :email => email, :location => location, :social1 => social1, :social2 => social2, :social3 => social3)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "latitude" = $1, "longitude" = $2, "location" = $3 WHERE "users"."id" = $4  [["latitude", 41.9219168], ["longitude", 12.4186735], ["location", "via stefano borgia 167, 00168 roma"], ["id", 1]]

    def editProfile_success
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]

    def editProfile_error
        @user = User.find(session[:user_id])
        @review = Review.where(:user_id => @user)
        @friends = Friend.where(:user_id => @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]

    def deleteUserConfirmation
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def show
        id = params[:id]
        @games = Game.find(id)
        @library = Store.where(:user_id => session[:user_id])
        @user = session[:user_id]
        @aux = Review.where(:game_id => @games)
        @aux = @aux.where('user_id != ?', @user)
        @review = Review.where(:game_id => @games, :user_id => @user)
        if (@review.length != 0 || @aux.length != 0)
            score = 0
            @review.each do |review|
                score = score+review.score
            end
            @aux.each do |aux|
                score = score+aux.score
            end
            score = score/(@review.length+@aux.length)
            @games.update_attributes(:score => score)
        else
            score = 0
            @games.update_attributes(:score => score)
        end
        api_endpoint = 'https://api-v3.igdb.com/games'
        request_headers = { headers: { 'user-key' => Rails.application.credentials.maps[:igdb] } }
        api = Apicalypse.new(api_endpoint, request_headers)
        api.fields(:summary).where(:id => @games.serial).request
        @plot = api.request[0].values[1]
        @users = Store.where(:selling => 'true', :condition => 'New', :game_id => id)
        @users1 = Store.where(:selling => 'true', :condition => 'Used', :game_id => id)
        @hash = Gmaps4rails.build_markers(@users) do |user, marker|
            if user.user_id==@user
                marker.lat User.find(user.user_id).latitude
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1 AND "stores"."game_id" = $2  [["user_id", 1], ["game_id", 6]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = $1 AND (user_id != 1)  [["game_id", 6]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = $1 AND "reviews"."user_id" = $2  [["game_id", 6], ["user_id", 1]]
UPDATE "games" SET "score" = $1 WHERE "games"."id" = $2  [["score", 0], ["id", 6]]
SELECT "stores".* FROM "stores" WHERE "stores"."selling" = $1 AND "stores"."condition" = $2 AND "stores"."game_id" = $3  [["selling", "true"], ["condition", "New"], ["game_id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def contactUs
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def deleteUser
        name = session[:user_id]
        @friends = Friend.where(:user_id => name)
        @friends.each do |friend|
            friend.delete
        end
        @friends1 = Friend.where(:friend_id => name)
        @friends1.each do |friend|
            friend.delete
        end
        @review = Review.where(:user_id => name)
        @review.each do |review|
            review.delete
        end
        @library = Store.where(:user_id => name)
        @library.each do |library|
            library.delete
        end
        @room = Room.where(:user1 => User.find(name).username)
        @room.each do |room|
            @messages = RoomMessage.where(:room_id => room.id)
            @messages.each do |message|
                message.delete
            end
            room.delete
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 2]]
SELECT "friends".* FROM "friends" WHERE "friends"."friend_id" = $1  [["friend_id", 2]]
DELETE FROM "friends" WHERE "friends"."id" = $1  [["id", 2]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 2]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1  [["user_id", 2]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user1" = $1  [["user1", "Giovanni Roma"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1  [["room_id", 7]]
DELETE FROM "room_messages" WHERE "room_messages"."id" = $1  [["id", 24]]
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 7]]

    def searchUser
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def searchingUser
        user = params[:username]
        if User.exists?(User.where(:username => user))
            if user==User.find(session[:user_id]).username
---
SELECT  1 AS one FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."username" = $1) LIMIT $2  [["username", "Nidran"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Nidran"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def searchGame
        @games = Game.all
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def searchResult
        @search = params[:search]
        genre = params[:game][:genre]
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def settings
        @users = User.where('username != ?', 'vgdb_admin')
        @reviews = Review.all
        @libraries = Store.all
        @user = session[:user_id]

        if !(User.find(@user).username == 'vgdb_admin' && User.find(@user).password == 'rdc2020')
---
SELECT "users".* FROM "users" WHERE (username != 'vgdb_admin')
SELECT "reviews".* FROM "reviews"
SELECT "stores".* FROM "stores"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    def deleteReviewsGame
        @user = session[:user_id]

        if !(User.find(@user).username == 'vgdb_admin' && User.find(@user).password == 'rdc2020')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    def deleteReviewsUser
        @user = session[:user_id]

        if !(User.find(@user).username == 'vgdb_admin' && User.find(@user).password == 'rdc2020')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def deleteReviewsUser_success
        @user = session[:user_id]

        if !(User.find(@user).username == 'vgdb_admin' && User.find(@user).password == 'rdc2020')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def deletingReviewsUser
        user1 = params[:user][:name]
        game1 = params[:game][:title]
        if(User.exists?(:username => user1) && Game.exists?(:title => game1))
            @user = User.where(:username => user1)[0].id
            @game = Game.where(:title => game1)[0].id
            if(Review.exists?(:user_id => @user,:game_id => @game))
                @review = Review.where(:user_id => @user,:game_id => @game)[0].id
                Review.delete(@review)
---
SELECT  1 AS one FROM "games" WHERE "games"."title" = $1 LIMIT $2  [["title", "Rspec_game"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "John Doe"], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."title" = $1  [["title", "Rspec_game"]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "John Doe"]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."user_id" = $1 AND "reviews"."game_id" = $2 LIMIT $3  [["user_id", 1], ["game_id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1 AND "reviews"."game_id" = $2  [["user_id", 1], ["game_id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]

    def deletingUser
        @user = session[:user_id]

        if !(User.find(@user).username == 'vgdb_admin' && User.find(@user).password == 'rdc2020')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def deletingAdminUser
        name = params[:user][:name]
        if name == 'vgdb_admin'
            redirect_to deletingUser_error_path
        else
            if User.exists?(User.where(:username => name))
                @user = User.where(:username => name)[0].id
                @friends = Friend.where(:user_id => @user)
                @friends.each do |friend|
                    friend.delete
                end
                @friends1 = Friend.where(:friend_id => @user)
                @friends1.each do |friend|
                    friend.delete
                end
                @review = Review.where(:user_id => @user)
                @review.each do |review|
                    review.delete
                end
                @library = Store.where(:user_id => @user)
                @library.each do |library|
                    library.delete
                end
                @room = Room.where(:user1 => name)
---
SELECT  1 AS one FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."username" = $1) LIMIT $2  [["username", "John Doe"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "John Doe"]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."friend_id" = $1  [["friend_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1  [["user_id", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user1" = $1  [["user1", "John Doe"]]

    def deletingUser_success
        @user = session[:user_id]

        if !(User.find(@user).username == 'vgdb_admin' && User.find(@user).password == 'rdc2020')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]