app/controllers/games_controller.rb

    def settings
        @users = User.all
---
SELECT "users".* FROM "users"