app/controllers/googles_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."google_token" = $1 LIMIT $2  [["google_token", "107806051862803998824"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."google_token" = $1  [["google_token", "107806051862803998824"]]
INSERT INTO "users" ("email", "username", "avatar", "background", "social1", "social2", "social3", "google_token", "google_username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def googleAuth
        auth = request.env['omniauth.auth']
        info = auth.info
        if session[:user_id]==nil
            if !User.exists?(:google_token => auth.uid)
                User.create(:username => info.name ,:google_username => info.name , :avatar => info.image, :google_token => auth.uid, :email => info.email,:background => 'deafult.png', :social1 => '', :social2 => '', :social3 => '')
                session[:user_id] = User.where(:google_token => auth.uid)[0].id
                cookies.encrypted[:user_id]=User.where(:google_token => auth.uid)[0].id
                redirect_to editProfileOauth_path
            else
                session[:user_id] = User.where(:google_token => auth.uid)[0].id
                cookies.encrypted[:user_id]=User.where(:google_token => auth.uid)[0].id
                redirect_to homepage_path
            end
        else
            if !User.exists?(:google_token => auth.uid)
                User.find(session[:user_id]).update_attributes(:google_username => info.name,:google_token => auth.uid)