app/controllers/rooms_controller.rb

    def edit
        id = params[:id]
        if Room.exists?(:user => User.find(id).username,:user1 => User.find(session[:user_id]).username)
            redirect_to room_path(Room.where(:user => User.find(id).username,:user1 => User.find(session[:user_id]).username)[0].id)
        elsif Room.exists?(:user => User.find(session[:user_id]).username,:user1 => User.find(id).username)
            redirect_to room_path(Room.where(:user => User.find(session[:user_id]).username,:user1 => User.find(id).username)[0].id)
        else
            Room.create(:user => User.find(id).username,:user1 => User.find(session[:user_id]).username)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "rooms" WHERE "rooms"."user" = $1 AND "rooms"."user1" = $2 LIMIT $3  [["user", "Nidran"], ["user1", "r.giovanni.98@gmail.com"], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user" = $1 AND "rooms"."user1" = $2  [["user", "Nidran"], ["user1", "r.giovanni.98@gmail.com"]]
INSERT INTO "rooms" ("user1", "user", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user1", "r.giovanni.98@gmail.com"], ["user", "Nidran"], ["created_at", "2020-07-02 08:51:21.611919"], ["updated_at", "2020-07-02 08:51:21.611919"]]

    def show
        id = params[:id]
        @room = Room.find(id)
        @room_messages = RoomMessage.where(:room => @room)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1  [["room_id", 1]]

    def update
        id = params[:id]
        text = params[:text]
        @message= RoomMessage.new(:message => text)
        @message.room_id = Room.find(id).id
        @message.user_id = session[:user_id]
        @message.save!
        redirect_to room_path(id)
        RoomChannel.broadcast_to(Room.find(id), @message)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "room_messages" ("room_id", "user_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["room_id", 1], ["user_id", 3], ["message", "ciao "], ["created_at", "2020-07-02 08:51:31.358981"], ["updated_at", "2020-07-02 08:51:31.358981"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]