app/controllers/sessions_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "r.giovanni.98@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Nidran"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "username", "password", "avatar", "background", "social1", "social2", "social3") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
def signin
        name = params[:user][:name]
        password = params[:user][:password]
        name1 = params[:user][:name1]
        password1 = params[:user][:password1]
        if User.exists?(:email => name)         # Vede se esiste già la mail
            redirect_to signup_error_mail_path
        elsif name1 == 'vgdb_admin'             # Non può creare un nuovo admin
            redirect_to signup_error_username_path
        elsif User.exists?(:username => name1)  # Username già esistente
            redirect_to signup_error_username_path
        elsif password != password1             # Password non coincidono
            redirect_to signup_error_password_path
        else                                    # Controlli a buon fine
            @users = User.create(:email => name, :password => password, :username => name1, :avatar => 'Avatars/avatar_0',:background => 'deafult.png', :social1 => '', :social2 => '', :social3 => '')

SELECT  1 AS one FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."username" = $1) LIMIT $2  [["username", "Nidran"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Nidran"]]
---
def create
    name = params[:user][:name]
    username = params[:user][:name1]
    password = params[:user][:password]
    if User.exists?(User.where(:username => name))

SELECT "games".* FROM "games"
---
def homepageGuest
    @games = Game.all

SELECT  1 AS one FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."username" = $1) LIMIT $2  [["username", "Marco"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Marco"]]
---
def searchingGuestUser
    user = params[:username]
    if User.exists?(User.where(:username => user))