app/controllers/steams_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."steam_token" = $1 LIMIT $2  [["steam_token", 76561198053742229], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."steam_token" = $1  [["steam_token", 76561198053742229]]
INSERT INTO "users" ("username", "avatar", "background", "social1", "social2", "social3", "steam_username", "steam_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def auth_callback
      auth = request.env['omniauth.auth']
      if session[:user_id]==nil
        if !User.exists?(:steam_token => auth.uid)
          User.create(:username => auth.info['nickname'],:steam_username => auth.info.values[4].values[0].split('id/')[1].split('/')[0],:avatar => auth.extra.raw_info['avatarfull'],:steam_token => auth.uid,:background => 'deafult.png', :social1 => '', :social2 => '', :social3 => '')