VGdatabase/app/views/visit/profile/show.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            %a.sidebar__nav__link{:href => myProfile_path, "data-method" => "get"}
              =image_tag (User.find(@users).avatar), class: "img3"

SELECT  1 AS one FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."friend_id" = 1 LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."friend_id" = ?  [["user_id", 5], ["friend_id", 1]]
---
            .grid-item-details
              -if (Friend.exists?(:user_id => @users, :friend_id => @user.id))

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                - @library.each do |game|
                  - @games = Game.find(game.game_id)
                  .card
                    .content.cardPadding